luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCcu6_regdef.h
/** \brief  Capture/Compare Register for Channel CC61 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CC61R_Bits B;                  /**< \brief Bitfield access */
} Ifx_CCU6_CC61R;

/** \brief  Capture/Compare Shadow Reg. for Channel CC61 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CC61SR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CCU6_CC61SR;

/** \brief  Capture/Compare Register for Channel CC62 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CC62R_Bits B;                  /**< \brief Bitfield access */
} Ifx_CCU6_CC62R;

/** \brief  Capture/Compare Shadow Reg. for Channel CC62 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CC62SR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CCU6_CC62SR;

/** \brief  Compare Register for T13 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CC63R_Bits B;                  /**< \brief Bitfield access */
} Ifx_CCU6_CC63R;

/** \brief  Compare Shadow Register for T13 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CC63SR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CCU6_CC63SR;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CLC_Bits B;                    /**< \brief Bitfield access */
} Ifx_CCU6_CLC;

/** \brief  Compare State Modification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CMPMODIF_Bits B;               /**< \brief Bitfield access */
} Ifx_CCU6_CMPMODIF;

/** \brief  Compare State Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CMPSTAT_Bits B;                /**< \brief Bitfield access */
} Ifx_CCU6_CMPSTAT;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_ID_Bits B;                     /**< \brief Bitfield access */
} Ifx_CCU6_ID;

/** \brief  Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_IEN_Bits B;                    /**< \brief Bitfield access */
} Ifx_CCU6_IEN;

/** \brief  Input Monitoring Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_IMON_Bits B;                   /**< \brief Bitfield access */
} Ifx_CCU6_IMON;

/** \brief  Interrupt Node Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_INP_Bits B;                    /**< \brief Bitfield access */
} Ifx_CCU6_INP;

/** \brief  Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_IS_Bits B;                     /**< \brief Bitfield access */
} Ifx_CCU6_IS;

/** \brief  Interrupt Status Reset Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_ISR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CCU6_ISR;

/** \brief  Interrupt Status Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_ISS_Bits B;                    /**< \brief Bitfield access */
} Ifx_CCU6_ISS;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_KRST0_Bits B;                  /**< \brief Bitfield access */
} Ifx_CCU6_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_KRST1_Bits B;                  /**< \brief Bitfield access */
} Ifx_CCU6_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_KRSTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_CCU6_KRSTCLR;

/** \brief  Kernel State Control Sensitivity Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_KSCSR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CCU6_KSCSR;

/** \brief  Lost Indicator Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_LI_Bits B;                     /**< \brief Bitfield access */
} Ifx_CCU6_LI;

/** \brief  Module Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_MCFG_Bits B;                   /**< \brief Bitfield access */
} Ifx_CCU6_MCFG;

/** \brief  Multi-Channel Mode Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_MCMCTR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CCU6_MCMCTR;

/** \brief  Multi-Channel Mode Output Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_MCMOUT_Bits B;                 /**< \brief Bitfield access */
} Ifx_CCU6_MCMOUT;

